[
    {
        "date_time": "Feb-10-26 03:01PM",
        "title": "Take-Two Stock's Drop Is 'Overdone.' AI Isn't Such a Worry."
    },
    {
        "date_time": "09:45AM",
        "title": "Under Armour cut to Sell, Snap upgraded: Wall Street's top analyst calls"
    },
    {
        "date_time": "12:35AM",
        "title": "5 Insightful Analyst Questions From Take-Two's Q4 Earnings Call"
    },
    {
        "date_time": "Feb-09-26 09:45AM",
        "title": "Why Take-Two Interactive (TTWO) is a Top Growth Stock for the Long-Term"
    },
    {
        "date_time": "Feb-07-26 12:56AM",
        "title": "Jim Cramer on Take-Two: \"I Do Think That You're Getting a Chance to Buy It\""
    },
    {
        "date_time": "Feb-06-26 05:09PM",
        "title": "Top Analyst Reports for AMD, Constellation Energy & Freeport-McMoRan"
    },
    {
        "date_time": "02:48PM",
        "title": "Take-Two, Mondelez Get Analyst Attention"
    },
    {
        "date_time": "Feb-05-26 08:21AM",
        "title": "The Week Ahead: Inflation Data Hits Amid Earnings Season"
    },
    {
        "date_time": "07:19AM",
        "title": "Wells Fargo Raises Take-Two Interactive (TTWO) PT To $301 Following Q3 Bookings Beat"
    },
    {
        "date_time": "Feb-04-26 03:35PM",
        "title": "Why Take-Two (TTWO) Shares Are Sliding Today"
    },
    {
        "date_time": "02:55PM",
        "title": "Nasdaq sinks as AMD fuels further tech slide"
    },
    {
        "date_time": "02:21PM",
        "title": "Take-Two Sees AI As Production Aid, Not Business Threat"
    },
    {
        "date_time": "12:06PM",
        "title": "Take-Two Misses Q3 Earnings Estimates, Raises FY26 Sales View"
    },
    {
        "date_time": "12:03PM",
        "title": "Take-Two Stock Drops Despite Raised Outlook. Why It Could Be a Buying Opportunity."
    },
    {
        "date_time": "11:25AM",
        "title": "Take-Two Interactive raises 2026 guidance as Q3 bookings surge"
    },
    {
        "date_time": "10:10AM",
        "title": "Software Stocks Slide Again as AI Threats Rattle Investors"
    },
    {
        "date_time": "06:22AM",
        "title": "Stock Index Futures Steady After Tech-Led Selloff, U.S. ADP Jobs Report and Alphabet Earnings in Focus"
    },
    {
        "date_time": "05:47AM",
        "title": "AMD shares dip, Super Micro's pop after earnings, and other early movers"
    },
    {
        "date_time": "05:41AM",
        "title": "These Stocks Are Todays Movers: AMD, Super Micro, Enphase, Alphabet, Chipotle, Silicon Labs, Take-Two, Novo Nordisk, and More"
    },
    {
        "date_time": "12:32AM",
        "title": "TTWO Q4 Deep Dive: Mobile and Franchise Momentum Outpace Analyst Expectations"
    },
    {
        "date_time": "12:02AM",
        "title": "Take-Two Interactive Software Inc (TTWO) Q3 2026 Earnings Call Highlights: Surpassing Guidance ..."
    },
    {
        "date_time": "Feb-03-26 09:15PM",
        "title": "Analyst Report: Take-Two Interactive Software, Inc."
    },
    {
        "date_time": "09:07PM",
        "title": "Take-Two Interactive Software Q3 Earnings Call Highlights"
    },
    {
        "date_time": "06:00PM",
        "title": "Take-Two (TTWO) Q3 Earnings: How Key Metrics Compare to Wall Street Estimates"
    },
    {
        "date_time": "05:51PM",
        "title": "Take-Two (TTWO) Q3 2026 Earnings Call Transcript"
    },
    {
        "date_time": "05:25PM",
        "title": "Take-Two Interactive (TTWO) Tops Q3 Earnings and Revenue Estimates"
    },
    {
        "date_time": "05:23PM",
        "title": "Take-Two Interactive: Blowout Q3 Earnings And More"
    },
    {
        "date_time": "05:00PM",
        "title": "Take-Two Interactive shares jump on strong booking outlook ahead of GTA VI"
    },
    {
        "date_time": "04:35PM",
        "title": "Take-Two Loss Narrows, Sales Climb on Higher Bookings"
    },
    {
        "date_time": "04:34PM",
        "title": "Take-Two: Fiscal Q3 Earnings Snapshot"
    },
    {
        "date_time": "04:28PM",
        "title": "Take-Two (NASDAQ:TTWO) Posts Better-Than-Expected Sales In Q4 CY2025"
    },
    {
        "date_time": "04:21PM",
        "title": "Video Game Maker Take-Two Crushes December-Quarter Estimates"
    },
    {
        "date_time": "04:11PM",
        "title": "Take-Two raises annual bookings forecast, sticks with 'GTA VI' November launch"
    },
    {
        "date_time": "04:05PM",
        "title": "Take-Two Interactive Software, Inc. Reports Results for Fiscal Third Quarter 2026"
    },
    {
        "date_time": "07:08AM",
        "title": "Unity's 25% Drop: Gaming Crisis or Buying Opportunity?"
    },
    {
        "date_time": "06:55AM",
        "title": "Get Me Out: Traders Dump Software Stocks as AI Fears Take Hold"
    },
    {
        "date_time": "Feb-02-26 08:55AM",
        "title": "These 2 Consumer Discretionary Stocks Could Beat Earnings: Why They Should Be on Your Radar"
    },
    {
        "date_time": "08:48AM",
        "title": "Video game stocks: Morgan Stanley weighs impact of Googles Genie 3"
    },
    {
        "date_time": "08:29AM",
        "title": "Palantir, AMD, Amazon and More Stocks with Earnings This Week"
    },
    {
        "date_time": "Feb-01-26 10:07PM",
        "title": "Take-Two (TTWO) To Report Earnings Tomorrow: Here Is What To Expect"
    },
    {
        "date_time": "11:31AM",
        "title": "Unity, Take-Two Shares Sink After Google Unveils AI World-Building Tech 'Project Genie'"
    },
    {
        "date_time": "Jan-31-26 07:00AM",
        "title": "MarketBeat Week in Review - 01/26 - 01/30"
    },
    {
        "date_time": "Jan-30-26 02:08PM",
        "title": "Visa Q1 earnings beat, Roblox falls on Google's Project Genie"
    },
    {
        "date_time": "02:01PM",
        "title": "Unity's stock becomes the latest victim of Google's AI ambitions"
    },
    {
        "date_time": "01:34PM",
        "title": "The Best in the World CM Punk Graces WWE 2K26 Cover as Four New Match Types, Upgrades to All Game Modes, and Unprecedented Roster Ensure The Show Never Stops"
    },
    {
        "date_time": "12:37PM",
        "title": "Videogame stocks slide on Google's AI model that turns prompts into playable worlds"
    },
    {
        "date_time": "11:43AM",
        "title": "Take-Two Gears Up to Report Q3 Earnings: How to Play the Stock"
    },
    {
        "date_time": "10:52AM",
        "title": "Unity stock falls alongside Take-Two,  Roblox after Googles Project Genie launch"
    },
    {
        "date_time": "Jan-29-26 05:50PM",
        "title": "Why Take-Two Interactive (TTWO) Dipped More Than Broader Market Today"
    },
    {
        "date_time": "01:00PM",
        "title": "The Week Ahead: Big-Name Earnings, Jobs Data on Tap"
    },
    {
        "date_time": "09:15AM",
        "title": "Unlocking Q3 Potential of Take-Two (TTWO): Exploring Wall Street Estimates for Key Metrics"
    },
    {
        "date_time": "09:13AM",
        "title": "Is Take-Two Interactive the Last Pure-Play Gaming Stock?"
    },
    {
        "date_time": "Jan-28-26 09:05AM",
        "title": "Take-Two Interactive Software, Inc. (TTWO): A Bull Case Theory"
    },
    {
        "date_time": "Jan-23-26 09:45AM",
        "title": "Here's Why Take-Two Interactive (TTWO) is a Strong Growth Stock"
    },
    {
        "date_time": "Jan-22-26 05:50PM",
        "title": "Take-Two Interactive (TTWO) Outperforms Broader Market: What You Need to Know"
    },
    {
        "date_time": "Jan-18-26 11:35PM",
        "title": "2 Internet Stocks with Competitive Advantages and 1 We Turn Down"
    },
    {
        "date_time": "Jan-16-26 07:19PM",
        "title": "Analyst Report: Take-Two Interactive Software, Inc."
    },
    {
        "date_time": "05:50PM",
        "title": "Take-Two Interactive (TTWO) Sees a More Significant Dip Than Broader Market: Some Facts to Know"
    },
    {
        "date_time": "Jan-15-26 04:37PM",
        "title": "Top Stock Reports for American Express, Intuitive Surgical & Booking"
    },
    {
        "date_time": "09:00AM",
        "title": "How to Find Strong Buy Consumer Discretionary Stocks Using the Zacks Rank"
    },
    {
        "date_time": "05:50AM",
        "title": "New Strong Buy Stocks for January 15th"
    },
    {
        "date_time": "Jan-13-26 08:20AM",
        "title": "Jim Cramer on Take-Two: \"Great Scarcity Value There\""
    },
    {
        "date_time": "07:55AM",
        "title": "Earnings Preview: What to Expect From Take-Two Interactive Softwares Report"
    },
    {
        "date_time": "Jan-09-26 09:50AM",
        "title": "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick"
    },
    {
        "date_time": "09:30AM",
        "title": "Is Take-Two (TTWO) a Buy as Wall Street Analysts Look Optimistic?"
    },
    {
        "date_time": "Jan-08-26 05:50PM",
        "title": "Take-Two Interactive (TTWO) Stock Falls Amid Market Uptick: What Investors Need to Know"
    },
    {
        "date_time": "Jan-07-26 09:45AM",
        "title": "Here's Why Take-Two Interactive (TTWO) is a Strong Growth Stock"
    },
    {
        "date_time": "Jan-06-26 11:32PM",
        "title": "1 Momentum  Stock with Promising Prospects and 2 We Question"
    },
    {
        "date_time": "12:10PM",
        "title": "Will Take-Two (TTWO) Beat Estimates Again in Its Next Earnings Report?"
    },
    {
        "date_time": "11:40AM",
        "title": "BYD vs. TTWO: Which Stock Is the Better Value Option?"
    },
    {
        "date_time": "08:55AM",
        "title": "Why Investors Need to Take Advantage of These 2 Consumer Discretionary Stocks Now"
    },
    {
        "date_time": "08:00AM",
        "title": "Take-Two Interactive Software, Inc. to Report Third Quarter Fiscal Year 2026 Results on Tuesday, February 3, 2026"
    },
    {
        "date_time": "Jan-05-26 09:32AM",
        "title": "These 3 Turnaround Contenders Could Be Set for a Big 2026 Break"
    },
    {
        "date_time": "Jan-03-26 10:00AM",
        "title": "2026 should be record year within the last decade of video games"
    },
    {
        "date_time": "Jan-02-26 05:50PM",
        "title": "Take-Two Interactive (TTWO) Stock Drops Despite Market Gains: Important Facts to Note"
    },
    {
        "date_time": "Dec-30-25 09:56AM",
        "title": "RBLX vs TTWO: Which Gaming Stock Has the Stronger 2026 Setup?"
    },
    {
        "date_time": "08:55AM",
        "title": "How to Find Strong Consumer Discretionary Stocks Slated for Positive Earnings Surprises"
    },
    {
        "date_time": "Dec-29-25 12:29PM",
        "title": "'Grand Theft Auto' Game Publisher Is A Steal, Analyst Says"
    },
    {
        "date_time": "11:09AM",
        "title": "Take-Two Stock Has Been Hurt by GTA 6 Delays. Bet on a 2026 Hit, Analyst Says."
    },
    {
        "date_time": "07:52AM",
        "title": "Here Are Mondays Top Wall Street Analyst Research Calls: Doximity, KB Home, NVIDIA, Okta, On Holdings, Take-Two Interactive, Vail Resorts, and More"
    },
    {
        "date_time": "Dec-26-25 07:19PM",
        "title": "Analyst Report: Take-Two Interactive Software, Inc."
    },
    {
        "date_time": "05:45PM",
        "title": "Take-Two Interactive (TTWO) Increases Despite Market Slip: Here's What You Need to Know"
    },
    {
        "date_time": "11:22AM",
        "title": "SE vs. TTWO: Which Gaming Stock Offers Better Growth Opportunity?"
    },
    {
        "date_time": "Dec-21-25 10:07AM",
        "title": "Jim Cramer on Take-Two Interactive: \"Strauss Zelnick Will Deliver\""
    },
    {
        "date_time": "Dec-19-25 11:40AM",
        "title": "CHDN vs. TTWO: Which Stock Is the Better Value Option?"
    },
    {
        "date_time": "Dec-18-25 07:35AM",
        "title": "If GTA VI Delivers, Take-Two Could Hit $300 in 2026"
    },
    {
        "date_time": "Dec-17-25 09:45AM",
        "title": "Here's Why Take-Two Interactive (TTWO) is a Strong Growth Stock"
    },
    {
        "date_time": "Dec-15-25 05:45PM",
        "title": "Why the Market Dipped But Take-Two Interactive (TTWO) Gained Today"
    },
    {
        "date_time": "Dec-11-25 11:36PM",
        "title": "1 S&P 500 Stock to Target This Week and 2 We Question"
    },
    {
        "date_time": "06:27AM",
        "title": "Buy Stocks on the Dip? Here's a Better Strategy."
    },
    {
        "date_time": "Dec-10-25 02:49PM",
        "title": "Buying Stocks on the Cheap Can Cost You More. Here's a Better Strategy."
    },
    {
        "date_time": "09:40AM",
        "title": "Amazon initiated, GE Vernova upgraded: Wall Street's top analyst calls"
    },
    {
        "date_time": "09:35AM",
        "title": "What's the State of Take-Two Interactive Software With Its Blockbuster Hit Looming in 2026?"
    },
    {
        "date_time": "09:09AM",
        "title": "Here Are Wednesdays Top Wall Street Analyst Research Calls: AbbVie, Amazon.com, Biogen, EchoStar, Ferrari, GE Vernova, PepsiCo, Take-Two Interactive, and More"
    },
    {
        "date_time": "Dec-09-25 08:55PM",
        "title": "What to Know Before Buying Take-Two Stock"
    },
    {
        "date_time": "11:48AM",
        "title": "Sea Limited Slides 33% in 3 Months: Time to Exit or Hold the Stock?"
    },
    {
        "date_time": "09:30AM",
        "title": "Brokers Suggest Investing in Take-Two (TTWO): Read This Before Placing a Bet"
    },
    {
        "date_time": "06:31AM",
        "title": "Is Take-Two Interactive Software Stock Outperforming the Dow?"
    },
    {
        "date_time": "Dec-08-25 11:36PM",
        "title": "3 Cash-Producing Stocks We Steer Clear Of"
    },
    {
        "date_time": "11:25AM",
        "title": "Does SE's Heavy Free Fire Dependence Pose a Risk to Garena's Growth?"
    }
]