[
    {
        "date_time": "Feb-28-25 04:44PM",
        "title": "Why Take-Two Interactive Software (TTWO) Is Among the Best Video Game Stocks to Buy Now"
    },
    {
        "date_time": "08:01AM",
        "title": "2 Large-Cap Stocks with Solid Fundamentals and 1 to Avoid"
    },
    {
        "date_time": "08:00AM",
        "title": "PGA TOUR 2K25 Tees Off Worldwide; Available Now"
    },
    {
        "date_time": "05:30AM",
        "title": "Videogamings All-In Bet: Can Two Titans Lift a $58 Billion Industry?"
    },
    {
        "date_time": "Feb-20-25 03:16PM",
        "title": "Is Take-Two Interactive Software (TTWO) One of the Best Fast Growth Stocks to Buy Right Now?"
    },
    {
        "date_time": "12:00PM",
        "title": "Apple unveils iPhone 16e, Arista reports Q4 beat: Morning Buzz"
    },
    {
        "date_time": "Feb-19-25 08:49AM",
        "title": "DA Davidson starts coverage of Take-Two at Buy, EA at Neutral"
    },
    {
        "date_time": "Feb-18-25 08:19PM",
        "title": "Analyst Report: Take-Two Interactive Software, Inc."
    },
    {
        "date_time": "Feb-14-25 06:26AM",
        "title": "Take-Two Interactive Software (TTWO): Among the Best Esports Stocks to Buy Now"
    },
    {
        "date_time": "Feb-11-25 09:30AM",
        "title": "Wall Street Bulls Look Optimistic About Take-Two (TTWO): Should You Buy?"
    },
    {
        "date_time": "08:00AM",
        "title": "Build Something You Believe In: Sid Meier's Civilization VII Now Available Worldwide"
    },
    {
        "date_time": "Feb-10-25 09:50AM",
        "title": "Take-Two Interactive CEO Strauss Zelnick on Grand Theft Auto VI: We couldn't be more excited"
    },
    {
        "date_time": "Feb-08-25 04:29PM",
        "title": "Why Take-Two Interactive Software (TTWO) Went Up On Friday?"
    },
    {
        "date_time": "Feb-07-25 04:40PM",
        "title": "S&P 500 Gains and Losses Today: Expedia Soars as Holiday Bookings Drive Earnings Beat"
    },
    {
        "date_time": "04:00PM",
        "title": "Take-Two stock surges after mixed Q3, net bookings growth"
    },
    {
        "date_time": "02:40PM",
        "title": "Why Take-Two (TTWO) Stock Is Trading Up Today"
    },
    {
        "date_time": "01:58PM",
        "title": "Why Take-Two Interactive Stock Is Skyrocketing Today"
    },
    {
        "date_time": "11:52AM",
        "title": "Top Stock Movers Now: Amazon, Expedia, Take-Two Interactive, and More"
    },
    {
        "date_time": "10:24AM",
        "title": "Q3 2025 Take-Two Interactive Software Inc Earnings Call"
    },
    {
        "date_time": "09:33AM",
        "title": "Take-Two Stock Jumps on Smaller-Than-Expected Loss, Affirmed 'GTA VI' Launch"
    },
    {
        "date_time": "05:13AM",
        "title": "Take-Two Interactive reiterates 2025 outlook, GTA VI launch in fall; stock jumps"
    },
    {
        "date_time": "02:24AM",
        "title": "Take-Two Interactive Software Inc (TTWO) Q3 2025 Earnings Call Highlights: Strong NBA 2K ..."
    },
    {
        "date_time": "12:00AM",
        "title": "Take-Two Interactive Software (TTWO) Q3 2025 Earnings Call Transcript"
    },
    {
        "date_time": "Feb-06-25 11:08PM",
        "title": "Analyst Report: Take-Two Interactive Software, Inc."
    },
    {
        "date_time": "06:00PM",
        "title": "Take-Two (TTWO) Reports Q3 Earnings: What Key Metrics Have to Say"
    },
    {
        "date_time": "05:40PM",
        "title": "Take-Two Interactive (TTWO) Q3 Earnings Surpass Estimates"
    },
    {
        "date_time": "05:14PM",
        "title": "Take-Two (NASDAQ:TTWO) Reports Sales Below Analyst Estimates In Q4 Earnings, But Stock Soars 6.8%"
    },
    {
        "date_time": "04:36PM",
        "title": "Take-Two: Fiscal Q3 Earnings Snapshot"
    },
    {
        "date_time": "04:31PM",
        "title": "Take-Two Sticks With Financial Guidance. Expect GTA VI in the Fall."
    },
    {
        "date_time": "04:05PM",
        "title": "Take-Two Interactive Software, Inc. Reports Results for Fiscal Third Quarter 2025"
    },
    {
        "date_time": "Feb-05-25 07:00PM",
        "title": "Amazon earnings, FedSpeak, mortgage rates: What to Watch"
    },
    {
        "date_time": "06:28PM",
        "title": "2 Internet Stocks to Stash Right Now and 1 to Ghost"
    },
    {
        "date_time": "08:11AM",
        "title": "Take-Two (TTWO) To Report Earnings Tomorrow: Here Is What To Expect"
    },
    {
        "date_time": "05:30AM",
        "title": "Options Traders Bet the Rally in Big Tech Stocks Has More Room to Run"
    },
    {
        "date_time": "Feb-04-25 12:45PM",
        "title": "Take-Two Interactive Software, Inc. (TTWO): Among the Best Low Risk High Growth Stocks To Invest In Now"
    },
    {
        "date_time": "12:00PM",
        "title": "Zyngas Game of Thrones: Legends Invites Fans to Join the Hunt in the Dragon Egg Hunt Sweepstakes"
    },
    {
        "date_time": "08:45AM",
        "title": "Take-Two Interactive Software Inc. (TTWO): Among the Gaming Stocks That Are Solid Bets Despite Tariffs"
    },
    {
        "date_time": "Feb-03-25 09:16AM",
        "title": "Exploring Analyst Estimates for Take-Two (TTWO) Q3 Earnings, Beyond Revenue and EPS"
    },
    {
        "date_time": "Jan-31-25 02:01PM",
        "title": "Leaked GTA 6 Release Date Puts Pressure on Take-Two (TTWO) to Deliver"
    },
    {
        "date_time": "Jan-29-25 12:03PM",
        "title": "Jim Cramer on Take-Two Interactive Software, Inc. (TTWO): This Is Their Year"
    },
    {
        "date_time": "Jan-28-25 05:50PM",
        "title": "Take-Two Interactive (TTWO) Stock Declines While Market Improves: Some Information for Investors"
    },
    {
        "date_time": "08:00AM",
        "title": "Roman Reigns Named WWE® 2K25 Cover Star as Franchise Evolves with Bloodline Showcase, Enhanced Gameplay Features, New Match Types, and New \"The Island\" Experience"
    },
    {
        "date_time": "Jan-27-25 04:22PM",
        "title": "According to Jim Cramer, Take-Two Interactive (TTWO) Is Playing It Right  Heres Why"
    },
    {
        "date_time": "11:55AM",
        "title": "Ryanair, Take-Two Interactive, Hilton: Trending Tickers"
    },
    {
        "date_time": "10:53AM",
        "title": "Cramer's Stop Trading: Take-Two Interactive"
    },
    {
        "date_time": "Jan-23-25 01:48PM",
        "title": "Why Take-Two Interactive Stock Is Sinking Today"
    },
    {
        "date_time": "Jan-22-25 05:50PM",
        "title": "Why Take-Two Interactive (TTWO) Outpaced the Stock Market Today"
    },
    {
        "date_time": "10:17AM",
        "title": "Netflix's Gaming Bet Pays Off With Hit Titles, Fueling Stock Surge and Take-Two Gains"
    },
    {
        "date_time": "Jan-14-25 05:50PM",
        "title": "Take-Two Interactive (TTWO) Surpasses Market Returns: Some Facts Worth Knowing"
    },
    {
        "date_time": "08:00AM",
        "title": "PGA TOUR® 2K25 Calls \"Next Round, Best Round\" On Golfs Biggest Stages"
    },
    {
        "date_time": "Jan-10-25 05:50PM",
        "title": "Analyst Report: Take-Two Interactive Software, Inc."
    },
    {
        "date_time": "Jan-09-25 09:30AM",
        "title": "Wall Street Analysts Think Take-Two (TTWO) Is a Good Investment: Is It?"
    },
    {
        "date_time": "08:00AM",
        "title": "Take-Two Interactive Software, Inc. to Report Third Quarter Fiscal Year 2025 Results on Thursday, February 6, 2025"
    },
    {
        "date_time": "Jan-08-25 05:50PM",
        "title": "Why Take-Two Interactive (TTWO) Outpaced the Stock Market Today"
    },
    {
        "date_time": "Jan-03-25 08:15AM",
        "title": "Take-Two Interactive Software, Inc. (TTWO): A Bull Case Theory"
    },
    {
        "date_time": "Jan-02-25 05:50PM",
        "title": "Take-Two Interactive (TTWO) Registers a Bigger Fall Than the Market: Important Facts to Note"
    },
    {
        "date_time": "Dec-28-24 06:55AM",
        "title": "Gaming industry sees diminished returns from graphics investing, NYT reports"
    },
    {
        "date_time": "Dec-26-24 05:50PM",
        "title": "Take-Two Interactive (TTWO) Gains As Market Dips: What You Should Know"
    },
    {
        "date_time": "Dec-25-24 06:54AM",
        "title": "Take-Two Interactive Software (TTWO) Is Among Billionaire Colemans Top Picks"
    },
    {
        "date_time": "Dec-24-24 09:30AM",
        "title": "Take-Two (TTWO) Is Considered a Good Investment by Brokers: Is That True?"
    },
    {
        "date_time": "Dec-23-24 02:30PM",
        "title": "Videogame Stocks Could Level Up in 2025. Watch Take-Two."
    },
    {
        "date_time": "Dec-20-24 05:45PM",
        "title": "Take-Two Interactive (TTWO) Rises Yet Lags Behind Market: Some Facts Worth Knowing"
    },
    {
        "date_time": "04:04AM",
        "title": "Take-Two (NASDAQ:TTWO): Strongest Q3 Results from the Video Gaming Group"
    },
    {
        "date_time": "Dec-13-24 05:12PM",
        "title": "There will be 'optionality' for media companies in 2025: Analyst"
    },
    {
        "date_time": "Dec-12-24 04:16AM",
        "title": "Three Reasons to Avoid TTWO and One Stock to Buy Instead"
    },
    {
        "date_time": "Dec-07-24 09:01AM",
        "title": "10 fast-growing software stocks to watch in 2025, including the runaway Palantir"
    },
    {
        "date_time": "Dec-06-24 11:31AM",
        "title": "Why Is Take-Two (TTWO) Up 6.1% Since Last Earnings Report?"
    },
    {
        "date_time": "Nov-30-24 05:00AM",
        "title": "A Bull Market Is Here: 2 Brilliant Stocks Down 31% and 12% to Buy Right Now"
    },
    {
        "date_time": "Nov-18-24 07:37PM",
        "title": "Analyst Report: Take-Two Interactive Software, Inc."
    },
    {
        "date_time": "Nov-14-24 09:00AM",
        "title": "Words With Friends Launches New Suite of Game Modes"
    },
    {
        "date_time": "Nov-11-24 10:20AM",
        "title": "Take-Two Interactive CEO Strauss Zelnick: We're an organic growth story going forward"
    },
    {
        "date_time": "Nov-08-24 07:26AM",
        "title": "Take-Two price target raised to $200 from $185 at BofA"
    },
    {
        "date_time": "12:06AM",
        "title": "Decoding Take-Two Interactive Software Inc (TTWO): A Strategic SWOT Insight"
    },
    {
        "date_time": "Nov-07-24 06:28PM",
        "title": "Why Take-Two Interactive Stock Crushed it on Thursday"
    },
    {
        "date_time": "01:44PM",
        "title": "Take-Two Stock Is Rising. Earnings Were Strong, and Grand Theft Auto VI Looms."
    },
    {
        "date_time": "11:45AM",
        "title": "Take-Two Soars 6%, Reaches 52-Week High as Investors Bet Big on GTA VI and Upcoming Hits"
    },
    {
        "date_time": "07:01AM",
        "title": "Q2 2025 Take-Two Interactive Software Inc Earnings Call"
    },
    {
        "date_time": "02:19AM",
        "title": "Take-Two Interactive Software Inc (TTWO) Q2 2025 Earnings Call Highlights: Strong Net Bookings ..."
    },
    {
        "date_time": "Nov-06-24 10:45PM",
        "title": "Take-Two Interactive Software (TTWO) Q2 2025 Earnings Call Transcript"
    },
    {
        "date_time": "06:30PM",
        "title": "Take-Two (TTWO) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates"
    },
    {
        "date_time": "05:40PM",
        "title": "Take-Two Interactive (TTWO) Tops Q2 Earnings and Revenue Estimates"
    },
    {
        "date_time": "05:31PM",
        "title": "Take-Twos (NASDAQ:TTWO) Q3 Sales Beat Estimates But Quarterly Guidance Underwhelms"
    },
    {
        "date_time": "04:37PM",
        "title": "Take-Two: Fiscal Q2 Earnings Snapshot"
    },
    {
        "date_time": "04:12PM",
        "title": "Take-Two beats quarterly results estimates on healthy gamer spending"
    },
    {
        "date_time": "04:05PM",
        "title": "Take-Two Interactive Software, Inc. Reports Results for Fiscal Second Quarter 2025"
    },
    {
        "date_time": "Nov-05-24 05:15PM",
        "title": "2024 election results, Fed meeting, earnings: What to Watch"
    },
    {
        "date_time": "Nov-01-24 09:15AM",
        "title": "Stay Ahead of the Game With Take-Two (TTWO) Q2 Earnings: Wall Street's Insights on Key Metrics"
    },
    {
        "date_time": "Oct-31-24 05:45PM",
        "title": "Take-Two Interactive (TTWO) Stock Moves -0.72%: What You Should Know"
    },
    {
        "date_time": "09:00AM",
        "title": "Investors Heavily Search Take-Two Interactive Software, Inc. (TTWO): Here is What You Need to Know"
    },
    {
        "date_time": "Oct-30-24 10:01AM",
        "title": "Analysts Estimate Take-Two Interactive (TTWO) to Report a Decline in Earnings: What to Look Out for"
    },
    {
        "date_time": "09:00AM",
        "title": "Zynga Poker and Rob Riggle Partner to Unveil Highly-Anticipated Multi-Table Tournaments"
    },
    {
        "date_time": "02:57AM",
        "title": "Take-Two Interactive Software, Inc. (TTWO): Among the Best Entertainment Stocks To Buy According to Analysts"
    },
    {
        "date_time": "Oct-29-24 11:00AM",
        "title": "Red Dead Redemption and Undead Nightmare Now Available For PC"
    },
    {
        "date_time": "Oct-28-24 05:50PM",
        "title": "Take-Two Interactive (TTWO) Stock Slides as Market Rises: Facts to Know Before You Trade"
    },
    {
        "date_time": "03:23PM",
        "title": "Will Take-Two Interactive (TTWO) Lead Growth with GTA VI and Other Releases?"
    },
    {
        "date_time": "Oct-23-24 09:57PM",
        "title": "Take-Two Interactive Software Inc. (TTWO): Among the Best Esports Stocks to Buy According to Hedge Funds"
    },
    {
        "date_time": "Oct-21-24 05:50PM",
        "title": "Take-Two Interactive (TTWO) Increases Despite Market Slip: Here's What You Need to Know"
    },
    {
        "date_time": "Oct-14-24 05:50PM",
        "title": "Take-Two Interactive (TTWO) Gains But Lags Market: What You Should Know"
    },
    {
        "date_time": "Oct-11-24 05:23PM",
        "title": "Is Take-Two Interactive Software Inc. (TTWO) Set for a Bull Run with NBA 2K25 Launch?"
    },
    {
        "date_time": "Oct-09-24 05:54PM",
        "title": "Take-Two Interactive Software Inc (TTWO) Q1 2025 Earnings Call Highlights: Strong Performance ..."
    }
]